student_bazaar/app/views/application/_categories_nav_bar.html.haml

SELECT `categories`.* FROM `categories` WHERE `categories`.`name` = 'Book' LIMIT 1
---
    / subcategories of book
    - Category.find_by(name: Book.to_s).children.each do |subcategory|