student_bazaar/app/views/application/index.html.haml

.row.hidden-sm.hidden-xs
  - if Product.popular_products.count > 0
    .col-md-9
---
SELECT `products`.* FROM `products` WHERE 1=0


  (function(){

    $(document).ready(function(){


      var word_array = [];

      #{
        Tag.popular_tags_from_cache.map { |tag| "word_array[word_array.length] = {text: \"#{tag.name}\", weight: \"#{tag.count}\", link: \"#{products_search_path(tag_id: tag.id)}\"}" }.join(";\n")
      }

      $("#cloud-tags").jQCloud(word_array);

    });

  })();
---
SELECT `tags`.* FROM `tags` ORDER BY `tags`.`id` DESC LIMIT 1